; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v13 ?v11)
             (pred_7 ?v4 ?v9)
             (pred_4 ?v13 ?v9)
             (pred_3 ?v2 ?v13 )
	     (pred_11 ?v13)
             (pred_9 ?v7)
             (pred_12 ?v4)
             (pred_5 ?v9)
             (pred_2 ?v13)
             (pred_1 ?v4)
             (pred_6 ?v13)
             (pred_8 ))



(:action op_5
:parameters (?v8 ?v1 ?v12 ?v3)
:precondition (and (pred_9 ?v8) (pred_9 ?v1) (pred_12 ?v12) (pred_5 ?v3)
          (pred_10 ?v8 ?v1) (pred_7 ?v12 ?v3)
                   (pred_4 ?v1 ?v3) (pred_11 ?v8) 
                   (pred_2 ?v1) (pred_1 ?v12))
:effect (and  (pred_6 ?v1) (not (pred_2 ?v1))))


(:action op_3
:parameters (?v8 ?v10)
:precondition (and (pred_9 ?v8) (pred_9 ?v10)
               (pred_11 ?v8) (pred_10 ?v8 ?v10) (pred_6 ?v10))
:effect (and (pred_11 ?v10) (not (pred_11 ?v8))))

(:action op_1
:parameters (?v8 ?v12)
:precondition (and (pred_9 ?v8) (pred_12 ?v12) 
                  (pred_11 ?v8) (pred_3 ?v12 ?v8) (pred_8 ))
:effect (and (pred_1 ?v12)
   (not (pred_3 ?v12 ?v8)) (not (pred_8 ))))


(:action op_4
:parameters (?v8 ?v5 ?v6)
:precondition (and (pred_9 ?v8) (pred_12 ?v5) (pred_12 ?v6)
                  (pred_11 ?v8) (pred_1 ?v6) (pred_3 ?v5 ?v8))
:effect (and (pred_1 ?v5) (pred_3 ?v6 ?v8)
        (not (pred_1 ?v6)) (not (pred_3 ?v5 ?v8))))

(:action op_2
:parameters (?v8 ?v12)
:precondition (and (pred_9 ?v8) (pred_12 ?v12) 
                  (pred_11 ?v8) (pred_1 ?v12))
:effect (and (pred_8 ) (pred_3 ?v12 ?v8) (not (pred_1 ?v12)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_10 obj_01 obj_17 obj_03 obj_02 obj_13 obj_19 obj_04 obj_08 obj_12 obj_21 obj_07 obj_20 obj_06 obj_05
    obj_18 obj_11
    obj_15 obj_16 obj_09
    )

    (:init
       (pred_8)

       (pred_9 obj_14)
       (pred_9 obj_10)
       (pred_9 obj_01)
       (pred_9 obj_17)
       (pred_9 obj_03)
       (pred_9 obj_02)
       (pred_9 obj_13)
       (pred_9 obj_19)
       (pred_9 obj_04)
       (pred_9 obj_08)
       (pred_9 obj_12)
       (pred_9 obj_21)
       (pred_9 obj_07)
       (pred_9 obj_20)
       (pred_9 obj_06)
       (pred_9 obj_05)
       (pred_5 obj_18)
       (pred_5 obj_11)
       (pred_12 obj_15)
       (pred_12 obj_16)
       (pred_12 obj_09)

       (pred_10 obj_14 obj_03)
       (pred_10 obj_14 obj_10)
       (pred_10 obj_10 obj_02)
       (pred_10 obj_10 obj_01)
       (pred_10 obj_10 obj_14)
       (pred_10 obj_01 obj_13)
       (pred_10 obj_01 obj_17)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_17 obj_19)
       (pred_10 obj_17 obj_01)
       (pred_10 obj_03 obj_04)
       (pred_10 obj_03 obj_02)
       (pred_10 obj_03 obj_14)
       (pred_10 obj_02 obj_08)
       (pred_10 obj_02 obj_13)
       (pred_10 obj_02 obj_10)
       (pred_10 obj_02 obj_03)
       (pred_10 obj_13 obj_12)
       (pred_10 obj_13 obj_19)
       (pred_10 obj_13 obj_01)
       (pred_10 obj_13 obj_02)
       (pred_10 obj_19 obj_21)
       (pred_10 obj_19 obj_17)
       (pred_10 obj_19 obj_13)
       (pred_10 obj_04 obj_07)
       (pred_10 obj_04 obj_08)
       (pred_10 obj_04 obj_03)
       (pred_10 obj_08 obj_20)
       (pred_10 obj_08 obj_12)
       (pred_10 obj_08 obj_02)
       (pred_10 obj_08 obj_04)
       (pred_10 obj_12 obj_06)
       (pred_10 obj_12 obj_21)
       (pred_10 obj_12 obj_13)
       (pred_10 obj_12 obj_08)
       (pred_10 obj_21 obj_05)
       (pred_10 obj_21 obj_19)
       (pred_10 obj_21 obj_12)
       (pred_10 obj_07 obj_20)
       (pred_10 obj_07 obj_04)
       (pred_10 obj_20 obj_06)
       (pred_10 obj_20 obj_08)
       (pred_10 obj_20 obj_07)
       (pred_10 obj_06 obj_05)
       (pred_10 obj_06 obj_12)
       (pred_10 obj_06 obj_20)
       (pred_10 obj_05 obj_21)
       (pred_10 obj_05 obj_06)
       (pred_2 obj_19)
       (pred_2 obj_20)
       (pred_2 obj_13)
       (pred_4  obj_19 obj_18)
       (pred_4  obj_20 obj_11)
       (pred_4  obj_13 obj_18)
       (pred_6 obj_14)
       (pred_6 obj_10)
       (pred_6 obj_01)
       (pred_6 obj_17)
       (pred_6 obj_03)
       (pred_6 obj_02)
       (pred_6 obj_04)
       (pred_6 obj_08)
       (pred_6 obj_12)
       (pred_6 obj_21)
       (pred_6 obj_07)
       (pred_6 obj_06)
       (pred_6 obj_05)

       (pred_7  obj_15 obj_18)
       (pred_7  obj_16 obj_11)
       (pred_7  obj_09 obj_18)
       (pred_3 obj_15 obj_17)
       (pred_3 obj_16 obj_10)
       (pred_3 obj_09 obj_02)
       (pred_11 obj_04)
    )

    (:goal (and
       (pred_3 obj_15 obj_10)
       (pred_3 obj_09 obj_05)
    ))
(:constraints
  (always (not (pred_11 obj_19)))
)
)

; plan
1. (op_3 obj_04 obj_08)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_08)
   goals met: 0 of 2
2. (op_3 obj_08 obj_02)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_02)
   goals met: 0 of 2
3. (op_1 obj_02 obj_09)
   deleted: (pred_3 obj_09 obj_02) (pred_8)
   added: (pred_1 obj_09)
   goals met: 0 of 2
4. (op_3 obj_02 obj_10)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_10)
   goals met: 0 of 2
5. (op_3 obj_10 obj_01)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_01)
   goals met: 0 of 2
6. (op_3 obj_01 obj_17)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_17)
   goals met: 0 of 2
7. (op_5 obj_17 obj_19 obj_09 obj_18)
   deleted: (pred_2 obj_19)
   added: (pred_6 obj_19)
   goals met: 0 of 2
8. (op_4 obj_17 obj_15 obj_09)
   deleted: (pred_1 obj_09) (pred_3 obj_15 obj_17)
   added: (pred_1 obj_15) (pred_3 obj_09 obj_17)
   goals met: 0 of 2
9. (op_3 obj_17 obj_01)
   deleted: (pred_11 obj_17)
   added: (pred_11 obj_01)
   goals met: 0 of 2
10. (op_3 obj_01 obj_10)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_10)
   goals met: 0 of 2
11. (op_2 obj_10 obj_15)
   deleted: (pred_1 obj_15)
   added: (pred_8) (pred_3 obj_15 obj_10)
   goals met: 1 of 2
12. (op_3 obj_10 obj_01)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_01)
   goals met: 1 of 2
13. (op_3 obj_01 obj_17)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_17)
   goals met: 1 of 2
14. (op_1 obj_17 obj_09)
   deleted: (pred_3 obj_09 obj_17) (pred_8)
   added: (pred_1 obj_09)
   goals met: 1 of 2
15. (op_3 obj_17 obj_01)
   deleted: (pred_11 obj_17)
   added: (pred_11 obj_01)
   goals met: 1 of 2
16. (op_5 obj_01 obj_13 obj_09 obj_18)
   deleted: (pred_2 obj_13)
   added: (pred_6 obj_13)
   goals met: 1 of 2
17. (op_3 obj_01 obj_13)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_13)
   goals met: 1 of 2
18. (op_3 obj_13 obj_12)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_12)
   goals met: 1 of 2
19. (op_3 obj_12 obj_21)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_21)
   goals met: 1 of 2
20. (op_3 obj_21 obj_05)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_05)
   goals met: 1 of 2
21. (op_2 obj_05 obj_09)
   deleted: (pred_1 obj_09)
   added: (pred_8) (pred_3 obj_09 obj_05)
   goals met: 2 of 2
